
## Plan Result (admin)

[CI link](https://github.com/hkak03key/terraform-useful-code/actions/runs/18247342427)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * module.aws_iam_openid_connect_provider_github_actions.aws_iam_openid_connect_provider.default


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.aws_iam_openid_connect_provider_github_actions.aws_iam_openid_connect_provider.default will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "default" {
        id              = "arn:aws:iam::***:oidc-provider/token.actions.githubusercontent.com"
        tags            = {
            "Name" = "admin-github-actions"
        }
      ~ thumbprint_list = [
          - "1b511abead59c6ce207077c0bf0e0043b1382612",
          + "2b18947a6a9fc7764fd8b5fb18a863b0c6dac24f",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.aws_cloudtrail.module.aws_s3_bucket_core.data.aws_caller_identity.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "default" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.aws_cloudtrail.module.aws_s3_bucket_core.data.aws_region.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "default" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.terraform_backend_admin.module.aws_s3_bucket_secure.module.aws_s3_bucket_core.data.aws_caller_identity.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "default" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.terraform_backend_admin.module.aws_s3_bucket_secure.module.aws_s3_bucket_core.data.aws_region.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "default" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_s3_bucket_core.data.aws_caller_identity.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "default" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.terraform_backend_ci_tf_module.module.aws_s3_bucket_secure.module.aws_s3_bucket_core.data.aws_region.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "default" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"ci-terraform","PRNumber":126,"Program":"tfcmt","SHA1":"d244c373cd56fe36b40ff5dab8a7444615cca296","Target":"admin","Vars":{},"WorkflowName":"CI Terraform"} -->